//=============================================================================
//
// メイン処理 [light.cpp]
// Author : 山田陵太
//
//=============================================================================
#include "light.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
//ライトクラスのコンストラクタ
//=============================================================================
CLight::CLight()
{
	//メモリの0クリア
	SecureZeroMemory(&m_Light, sizeof(D3DLIGHT9));
}

//=============================================================================
//ライトクラスのデストラクタ
//=============================================================================
CLight::~CLight()
{
}

//=============================================================================
//ライトクラスの初期化処理
//=============================================================================
HRESULT CLight::Init(void)
{
	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();

	//ライトの方向ベクトル
	D3DXVECTOR3 vecDir;

	//ライトをクリアする
	SecureZeroMemory(&m_Light, sizeof(D3DLIGHT9));

	//ライトタイプの指定
	m_Light.Type = D3DLIGHT_DIRECTIONAL;

	//光の拡散の指定
	m_Light.Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);

	//ライト方向の指定
	vecDir = D3DXVECTOR3(-0.2, -1.0, -1.0);

	//正規化する（大きさ1のベクトルにする必要がある）
	D3DXVec3Normalize(&vecDir, &vecDir);

	m_Light.Direction = vecDir;

	//ライトを設定する
	pDevice->SetLight(0, &m_Light);

	//ライトを有効にする
	pDevice->LightEnable(0, TRUE);

	return S_OK;
}

//=============================================================================
//ライトクラスの終了処理
//=============================================================================
void CLight::Uninit(void)
{
}

//=============================================================================
//ライトクラスの更新処理
//=============================================================================
void CLight::Update(void)
{
}
